app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "phone_number", "password_digest", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
      user = User.find(params[:mods][:user][:id])
      user.update(update_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "TESTtee"], ["updated_at", "2018-06-03 05:55:58.171142"], ["id", 1]]

  def destroy
      puts(params[:id])
      User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]