app/controllers/user_token_controller.rb

    def login
      user = User.find_by(email:auth_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]