app/controllers/yelp_controller.rb

   def get_next_course

     filter = input_params

     userId = params[:filter][:userId]
     groupId = params[:filter][:groupId]

     # Step 1, find all friends associated with group_id
     selectedGroup = Group.find(groupId)
     friends = selectedGroup.friends
     winFriendIndex = rand(friends.length) - 1
     winningFriend = friends[winFriendIndex]

     #  actual yelp API call
     response = search(selectedGroup,winningFriend)

     # puts "Found #{response["total"]} businesses. Listing #{SEARCH_LIMIT}:"
     # response["businesses"].each {|biz| puts biz["name"]}

     winNumber = rand(response["businesses"].length) - 1

     winning_restaurant = response["businesses"][winNumber]

     winningRestaurant = winning_restaurant["name"]
     winningUrl = winning_restaurant["url"]

     user = User.find(userId  )
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."group_id" = $1  [["group_id", 89]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


     outing = Outing.new(outingParams)

     user.outings << outing
---
INSERT INTO "outings" ("winner", "winning_restaurant", "winning_group", "created_at", "updated_at", "user_id", "url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"